n = int(input())
max_digit = -1 # нельзя брать n % 10, так как эта цифра может быть не кратна 3.

while n > 0:
    digit = n % 10
    if digit % 3 == 0:
        if digit > max_digit: # для поиска максимума нужен знак >, а не <
            max_digit = digit # нужно обновлять max_digit, переменные перепутаны местами

    n = n // 10 # оператор % 10 зацикливает программу.

if max_digit == -1: # проверка == 0 сломает логику, если максимумом станет цифра 0.

    print('NO')
else:
    print(max_digit)
