mx = -10 ** 6 - 1 # максимум для отрицательных чисел должен быть меньше минимально возможного (-10^6)

s = 0
for i in range(10): # range(11) выполнит цикл 11 раз вместо 10.
    x = int(input())
    if x < 0:
        s = s + x # нужно прибавлять число к сумме, а не перезаписывать её

    if x > mx: # поиск максимума должен быть строго внутри условия 'if x < 0'
        mx = x # (в исходном коде он смещен и проверяет любые числа, включая положительные)

if s == 0: # не было проверки на отсутствие отрицательных чисел.

    print('NO')
else:
    print(s)
    print(mx)
